#+title: Wgtunnel
** listening on ip sockets
#+begin_src shell
lsof -i -n -P | grep tunneld
#+end_src

#+RESULTS:
#+begin_example
tunneld   3757815   ii    3u  IPv4  477030064      0t0  UDP *:54321
tunneld   3757815   ii    7u  IPv6  477030065      0t0  UDP *:54321
tunneld   3757815   ii   11u  IPv6  477020952      0t0  TCP *:12345 (LISTEN)
#+end_example

** api

#+begin_src shell
curl -X POST http://localhost:12345/api/v2/clients
#+end_src

#+RESULTS:
#+begin_example
{"message":"Not found."}
#+end_example
** top level
#+begin_src shell
curl https://try.sharing.io
#+end_src

#+RESULTS:
#+begin_example
https://coder.com
#+end_example
** api

#+begin_src shell
curl -X POST https://try.sharing.io/api/v2/clients
#+end_src

#+RESULTS:
#+begin_example
{"message":"Request body must be valid JSON.","detail":"EOF"}
#+end_example

** kubectl apply
#+begin_src shell
kubectl apply -f tunneld-deployment.yaml
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/tunneld configured
#+end_example
** kubectl describe

#+begin_src shell
kubectl describe svc tunneld-wg
#+end_src

#+RESULTS:
#+begin_example
Name:              tunneld-wg
Namespace:         hh
Labels:            <none>
Annotations:       <none>
Selector:          spaceapp=iipod,spacename=london
Type:              ClusterIP
IP Family Policy:  SingleStack
IP Families:       IPv4
IP:                10.109.106.31
IPs:               10.109.106.31
Port:              wg  54321/UDP
TargetPort:        54321/UDP
Endpoints:         10.0.0.145:54321
Session Affinity:  None
Events:            <none>
#+end_example

** kubectl logs

#+begin_src shell
kubectl logs -n coder deployment/tunneld
#+end_src

#+RESULTS:
#+begin_example
2023-09-01 22:00:02.112 [INFO]	<main.go:247>	parsed private key	{"hash": "2986dc826aa49ad386d8e5897c4aeec23c6db3390675bfa3cb20d640e387fab3b9b7dc69e21c17780b3f01742f7491247d833c1340035cba35d9711f07818e22"}
2023-09-01 22:00:02.115 [INFO]	<main.go:298>	listening for requests	{"listen_address": "0.0.0.0:12345"}
#+end_example

** kubectl apply
#+begin_src shell
kubectl apply -f tunneld-wg-svc.yaml
#+end_src

#+RESULTS:
#+begin_example
service/tunneld-wg created
#+end_example
** kubectl describe

#+begin_src shell
kubectl describe svc tunneld-wg
#+end_src

#+RESULTS:
#+begin_example
Name:              tunneld-wg
Namespace:         hh
Labels:            <none>
Annotations:       <none>
Selector:          app=tunneld
Type:              ClusterIP
IP Family Policy:  SingleStack
IP Families:       IPv4
IP:                10.108.123.154
IPs:               10.108.123.154
Port:              wg  54321/UDP
TargetPort:        54321/UDP
Endpoints:         <none>
Session Affinity:  None
Events:            <none>
#+end_example

** kubectl apply
#+begin_src shell
kubectl apply -f tunneld-api-svc.yaml
#+end_src

#+RESULTS:
#+begin_example
service/tunneld-api created
#+end_example
** kubectl describe

#+begin_src shell
kubectl -n coder describe svc tunneld-api
#+end_src

#+RESULTS:
#+begin_example
Name:              tunneld-api
Namespace:         coder
Labels:            <none>
Annotations:       <none>
Selector:          app=tunneld
Type:              ClusterIP
IP Family Policy:  SingleStack
IP Families:       IPv4
IP:                10.106.193.181
IPs:               10.106.193.181
Port:              http  80/TCP
TargetPort:        12345/TCP
Endpoints:         10.0.0.99:12345
Session Affinity:  None
Events:            <none>
#+end_example

** kubectl apply cert
#+begin_src shell
kubectl apply -f cert.yaml
#+end_src

#+RESULTS:
#+begin_example
certificate.cert-manager.io/try created
#+end_example
** kubectl describe cert

#+begin_src shell
kubectl -n coder describe certs try
#+end_src

#+RESULTS:
#+begin_example
Name:         try
Namespace:    coder
Labels:       <none>
Annotations:  <none>
API Version:  cert-manager.io/v1
Kind:         Certificate
Metadata:
  Creation Timestamp:  2023-09-01T22:02:32Z
  Generation:          1
  Resource Version:    1731774
  UID:                 fb214973-3b65-4351-a086-77d8d0f224ab
Spec:
  Common Name:  *.try.sharing.io
  Dns Names:
    try.sharing.io
    ,*.try.sharing.io
  Issuer Ref:
    Group:      cert-manager.io
    Kind:       ClusterIssuer
    Name:       letsencrypt-pdns
  Secret Name:  try-tls
Status:
  Conditions:
    Last Transition Time:  2023-09-01T22:02:36Z
    Message:               Certificate is up to date and has not expired
    Observed Generation:   1
    Reason:                Ready
    Status:                True
    Type:                  Ready
  Not After:               2023-11-30T21:02:34Z
  Not Before:              2023-09-01T21:02:35Z
  Renewal Time:            2023-10-31T21:02:34Z
  Revision:                1
Events:
  Type    Reason     Age   From                                       Message
  ----    ------     ----  ----                                       -------
  Normal  Issuing    13s   cert-manager-certificates-trigger          Issuing certificate as Secret does not exist
  Normal  Generated  13s   cert-manager-certificates-key-manager      Stored new private key in temporary Secret resource "try-lmgx5"
  Normal  Requested  13s   cert-manager-certificates-request-manager  Created new CertificateRequest resource "try-456ss"
  Normal  Issuing    9s    cert-manager-certificates-issuing          The certificate has been successfully issued
#+end_example

** kubectl describe secret

#+begin_src shell
kubectl -n coder describe secret try-tls
#+end_src

#+RESULTS:
#+begin_example
Name:         try-tls
Namespace:    coder
Labels:       controller.cert-manager.io/fao=true
Annotations:  cert-manager.io/alt-names: *.try.sharing.io,try.sharing.io
              cert-manager.io/certificate-name: try
              cert-manager.io/common-name: *.try.sharing.io
              cert-manager.io/ip-sans:
              cert-manager.io/issuer-group: cert-manager.io
              cert-manager.io/issuer-kind: ClusterIssuer
              cert-manager.io/issuer-name: letsencrypt-pdns
              cert-manager.io/uri-sans:

Type:  kubernetes.io/tls

Data
====
tls.crt:  5538 bytes
tls.key:  1679 bytes
#+end_example

** kubectl apply ingress
#+begin_src shell
kubectl apply -f ingress.yaml
#+end_src

#+RESULTS:
#+begin_example
ingress.networking.k8s.io/try configured
#+end_example
** kubectl describe ingress
#+begin_src shell
kubectl -n coder describe ingress try
#+end_src

#+RESULTS:
#+begin_example
Name:             try
Labels:           <none>
Namespace:        coder
Address:
Ingress Class:    nginx
Default backend:  <default>
TLS:
  try-tls terminates try.sharing.io,*.try.sharing.io
Rules:
  Host              Path  Backends
  ----              ----  --------
  try.sharing.io
                    /   tunneld-api:http (10.0.0.99:12345)
  ,*.try.sharing.io
                    /   tunneld-api:http (10.0.0.99:12345)
Annotations:        nginx.ingress.kubernetes.io/proxy-read-timeout: 3600
                    nginx.ingress.kubernetes.io/proxy-send-timeout: 3600
                    nginx.ingress.kubernetes.io/server-snippets:
                      location / {
                      proxy_set_header Upgrade $http_upgrade;
                      proxy_http_version 1.1;
                      proxy_set_header X-Forwarded-Host $http_host;
                      proxy_set_header X-Forwarded-Proto $scheme;
                      proxy_set_header X-Forwarded-For $remote_addr;
                      proxy_set_header Host $host;
                      proxy_set_header Connection "upgrade";
                      proxy_cache_bypass $http_upgrade;
                      }
Events:
  Type    Reason  Age   From                      Message
  ----    ------  ----  ----                      -------
  Normal  Sync    7s    nginx-ingress-controller  Scheduled for sync
#+end_example
** get
#+begin_src shell
kubectl -n coder get endpoints | grep tunneld
#+end_src

#+RESULTS:
#+begin_example
tunneld-api              10.0.0.99:12345   2m24s
tunneld-wg               10.0.0.99:54321   4s
#+end_example
